app/controllers/api/songs_controller.rb

    def show
        @song = Song.includes(:album, :artist).with_attached_audio_file.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1  [["id", 2]]